def area(a, b):
    '''Возвращает площадь прямоугольника с заданными сторонами.
            
            Параметры:
                a (double): первое вещественное число
                b (double): второе вещественное число
                
            Возвращаемое значение:
                rectangle_area (double): вещественное значение площади прямоугольника
    '''
    return a * b 

def perimeter(a, b):
    '''Возвращает периметр прямоугольника с заданными сторонами.
            
            Параметры:
                a (double): первое вещественное число
                b (double): второе вещественное число
                
            Возвращаемое значение:
                rectangle_perimeter (double): вещественное значение периметра прямоугольника
    '''
    return 2 * (a + b)